{"entries":[{"skip_index":true,"title":"Search results","url":"/solidus-guides/search/","tags":[],"body":""},{"title":"Introduction","url":"/solidus-guides/","tags":[],"body":"Solidus Guides"},{"title":"Solidus User Documentation","url":"/solidus-guides/users/","tags":[],"body":"## Solidus User Documentation Welcome to the Solidus User Guides! This documentation is intended for business owners and site administrators of Solidus e-commerce sites. Everything you need to know to configure and manage your Solidus store can be found here. Should you find any errors in these guides, or topics you wish to see covered, please let us know by joining, then sending an email to the [#solidus.io](http://webchat.freenode.net/?channels=solidus.io) on freenode."},{"title":"Configuration","url":"/solidus-guides/users/configuration/","tags":[],"body":"## Configuration The Configuration page of the Admin Interface is that area of your store where you implement decisions about how you want your store to be set up. This is where you decide which shipping methods you offer, which categories you assign to product, how you want currency displayed, and dozens of other settings. The guides in this section will walk you through making all of those configuration decisions, and show you how to customize your Solidus store to best fit your particular needs."},{"title":"Analytics Tracker","url":"/solidus-guides/users/configuration/configuring_analytics/","tags":[],"body":"## Introduction Understanding your site's visitor traffic patterns are important for planning your company's marketing and growth strategies. ### Google Analytics Solidus's Admin Interface makes it easy for you to add the robust Google Analytics toolset to your site. [This blog entry](http://Soliduscommerce.com/blog/ecommerce-tracking-in-Solidus) covers all of the intricacies with registering a Google Analytics account, adding the tracker to your site, and testing the functionality."},{"title":"General Settings","url":"/solidus-guides/users/configuration/configuring_general_settings/","tags":[],"body":"## Introduction The General Settings section is where you will make site-wide settings about things like your store's name, security, and currency display. You can access this area by going to your Admin Interface, clicking \"Configuration\", then clicking the \"General Settings link.\" ![General Settings Configuration](/images/user/config/general_settings.jpg) Each setting on the page is covered below. ### Site Name The Site Name is what is set in the `` tag of your website. It renders in your browser's title bar on every page of the public-facing area of the site. ![Site Name in Title](/images/user/config/site_name_in_title.jpg) ### Default SEO Title \"SEO\" stands for \"Search Engine Optimization\". It is a way to improve your store's visibility in search results. If you assign a value to the Default SEO Title field, it would override what you had set for the \"Site Name\" field. ![SEO Title Override](/images/user/config/seo_title_override.jpg) ### Default Meta Keywords Meta keywords give search engines more information about your store. Use them to supply a list of the words and phrases that are most relevant to the products you offer. These keywords show up in the header of your site. The header is not visible to the casual site visitor, but it does inform your rankings with web browsers. *** For more information about Search Engine Optimization, try reading the [Google Webmaster Tools topic](https://support.google.com/webmasters/answer/35291?hl=en) on the subject. *** ### Default Meta Description Whereas meta keywords constitutes a comma-separated list of words and phrases, the meta description is a fuller, prose description of what your store is and does. The phrasing you use can help distinguish you from any other e-commerce websites offering products similar to yours. ### Site URL The site's URL is the website address for your store, such as \"http://myawesomestore.com\". This address is used when your application sends out confirmation emails to customers about their purchases. ### Security Settings Three of the four checkboxes in the \"Security Settings\" section of your General Settings cover which modes in which [SSL (Secure Sockets Layer)](http://en.wikipedia.org/wiki/Secure_Socket_Layer) can be used on your website. SSL is the way data is encrypted and sent securely through the Internet from the user to the server on which your store resides. By default, your store will use SSL only in production and staging. Production mode is commonly referred to as \"live\" mode - real data, real users, real transactions. Staging mode is similar to dress rehearsal - real data, possibly real users, fake transactions. Development mode is the mode your site's programmer is in as he works on your site. This is typically not deployed anywhere that real users could get to it, so SSL is usually not needed. Testing mode involves no outside user input at all; it is how your programmer tests functionality in an automated way before the application meets actual end users. If you're not sure how or whether to use SSL, ask your site's developer for guidance. The fourth checkbox - \"Check for Solidus Alerts\" - will disable the polling and display of important security and release announcements from Solidus Commerce, Inc. These alerts appear on the Admin Interface pages, and may be dismissed after you have read them. ## Currency Settings The remaining settings all cover how currency is rendered in your store. ![Currency Settings](/images/user/config/currency_settings.jpg) ### Display Currency If you check this option, the three-letter symbol for the currency of your store is rendered next to each price. ![Show Currency](/images/user/config/show_currency.jpg) ### Hide Cents Checking this option renders all prices in your store to whole-dollar amounts. The system will not round up to the nearest dollar; it will simply drop anything after the decimal. ### Choose Currency From this drop-down menu, select the currency of your store. Default is United States Dollars (USD). ### Currency Symbol Location You can elect to have the currency symbol (if applicable) appear either before or after the amount. Default for USD is to have the \"$\" sign appear before the amount. ### Currency Decimal Mark This is where you input what will separate whole amounts from partial amounts (cents). Default is to use a period (\".\") but you can change it to any character, symbol, or string that you want. ### Currency Thousands Separator The default setting is \",\", which takes a price of $1999.00 and renders it as \"$1,999.00\" (assuming you left the other settings at default). You can leave the thousands separator blank to have your store render the price as \"$1999.00\", or change it to anything you like."},{"title":"Zones, Countries, and States","url":"/solidus-guides/users/configuration/configuring_geography/","tags":[],"body":"## Introduction Your Solidus store allows you to make decisions about which parts of the world you will sell products to, and how those areas are grouped into geographical regions for the convenience of setting [shipping](shipments) and [taxation](taxation) policies. This is accomplished through the use of: * [zones](#zones) * [countries](#countries), and * [states](#states) ### Zones Within a Solidus store, zones are geographical groupings - collections of either states or countries. You can read all about zones in the [zones guide](zones), including how to [create zones](#zones#creating-a-zone), how to [add members to a zone](zones#adding-members-to-a-zone), and how to [remove members from a zone](zones#removing-members-from-a-zone). ### Countries If you pre-loaded the seed data into your Solidus store, then you already have several countries configured. You may want to edit items in this list based on your needs. To access the Countries list, go to your Admin Interface, click \"Configuration\", then click \"Countries\". ![Countries List](/images/user/config/countries.jpg) #### Editing a Country ![Edit Country Icon](/images/user/config/edit_country_icon.jpg) To edit a country, click the \"Edit\" icon next to the country. ![Editing Country Form](/images/user/config/editing_country.jpg) On this page, you can input the country's name, its [ISO Name](https://www.iso.org/obp/ui/#search), and whether or not a state name is required at the time of checkout for orders either billed to or shipped to an address in this country. Click \"Update\" to save any changes. ### States A Solidus store pre-loaded with seed data already has all of the states in the US configured for it. ![US States](/images/user/config/us_states_list.jpg) You can edit, remove, or add states to your store to suit your needs. #### Editing a State To edit an existing store, click the \"Edit\" icon next to its name in the list. ![Edit State Icon](/images/user/config/edit_state_icon.jpg) You can change the name and abbreviation for the state. Click \"Update\" to save your changes. ![Editing State](/images/user/config/editing_state.jpg) #### Removing a State To remove a state from your store, click the \"Delete\" icon next to its name in the list. ![Deleting State Icon](/images/user/config/edit_state_icon.jpg) Click \"OK\" to confirm the deletion. #### Adding a State To add a state to your store, first select the country the state belongs to from the \"Country\" drop-down list. ![Select a Country From the List](/images/user/config/countries_drop_down.jpg) Next, click the \"New State\" button. A data entry form appears. Enter the name and abbreviation for the new state, and click \"Create\". ![New State Form](/images/user/config/new_state_form.jpg) The new state is created, and you can now edit or delete it like the other states. ![State Added to List](/images/user/config/state_added.jpg) *** Don't forget to add new states and countries to your store's [zones](zones), so the system can accurately calculate tax and shipping options. ***"},{"title":"Inventory Settings","url":"/solidus-guides/users/configuration/configuring_inventory/","tags":[],"body":"## Introduction The Solidus store gives you a great deal of leverage in managing your business' inventory. You can set up multiple [stock locations](#stock-locations), each of which represents a physical location at which you store your products for delivery to customers. As you add new products and make sales, [stock movements](#stock-movements) are recorded. You can receive stock from a supplier, and even move products from one stock location to another by recording [stock transfers](#stock-transfers). All of this helps to keep your inventorying manageable and current. ### Stock Locations To reach the Stock Locations management panel, go to your Admin Interface, click \"Configuration\", then click \"Stock Locations\". Your store should already have at least one default stock location. If you keep all of your inventory in one place, this may be all you need. #### Create a New Stock Location To add a stock location to your store, click the \"New Stock Location\" button. ![New Stock Location](/images/user/config/new_stock_location.jpg) Here, you can input everything of relevance about your stock location: name, address, and phone are the most obvious. The three checkboxes on the right-hand side merit more explanation: * **Active** - Denotes whether the stock location is currently in operation and serving inventory for orders. * **Backorderable Default** - Controls whether inventory items at this location can be backordered when they run out. You can still change this on an item-by-item basis as needed. * **Propagate All Variants** - Checking this option when you create a new stock location will loop through all of the products you already have in your store, and create an entry for each one at your new location, with a starting inventory amount of 0. Input the values for all of the fields, and click \"Create\" to add your new stock location. #### Edit a Stock Location To edit a stock location, click the \"Edit\" icon next to it in the Stock Locations list. ![Edit Stock Location Icon](/images/user/config/edit_stock_location_icon.jpg) Make the desired changes in the form and click \"Update\". #### Delete a Stock Location To remove a stock location, click the \"Delete\" icon next to it in the Stock Locations list. ![Delete Stock Location Icon](/images/user/config/delete_stock_location_icon.jpg) Click \"OK\" to confirm the deletion. ### Stock Movements Notice the \"Stock Movements\" link on the Stock Locations list. ![Stock Movements Link](/images/user/config/stock_movements_link.jpg) Clicking this link will show you all of the stock movements that have taken place for this stock location, both positive and negative. Stock movements are actions that happen automatically through the normal management and functioning of your store. You do not have to (and in fact, can not) manually manipulate them. This is just a way for you to see which things are moving in and out of a particular stock location. ### Stock Transfers If you have more than one stock location, your Solidus store offers you a way to record the movement on inventory from one location to another: the stock transfer. To create a new stock transfer, go to your Admin Interface, click \"Configuration\", then \"Stock Transfers\", then click the \"New Stock Transfer\" button. ![New Stock Transfer](/images/user/config/new_stock_transfer.jpg) You can enter an optional Reference Number - this could correlate to a PO number, a transfer request number, a tracking number, or any other identifier you wish to use. Next, select your Source and Destination stock locations. If you are receiving stock from a supplier, check the \"Receive Stock\" checkbox and the \"Source\" drop-down box will be hidden. Select a product variant from the \"Variant\" drop-down list and enter the quantity of that product being transferred. Click the \"Add\" button. ![Stock Transfer Readied](/images/user/config/stock_transfer.jpg) *** If you try to transfer an item that you do not have in stock at your Source location, the Solidus system will record a stock transfer with a quantity of 0. *** The new stock transfer is readied. Once you have added all of the items you want to transfer, click the \"Transfer Stock\" button. ![Stock Transfer Complete](/images/user/config/stock_transfer_complete.jpg) Now when you look at the [Stock Movements](#stock-movements) for each of the stock locations, you see that there are two new entries that correspond to the stock transfer, both with a system-assigned \"Action\" number (actually, the id for the stock transfer). ![Resulting Stock Movements](/images/user/config/resulting_stock_movements.jpg)"},{"title":"Shipping Settings","url":"/solidus-guides/users/configuration/configuring_shipping/","tags":[],"body":"## Introduction # Shipping Methods # Shipping Categories"},{"title":"Taxes","url":"/solidus-guides/users/configuration/configuring_taxes/","tags":[],"body":"## Introduction Taxation, as you undoubtedly already know, is a very complicated topic. It can be challenging to manage taxation settings in an e-commerce store - particularly when you sell a variety of types of goods - but the Solidus shopping cart system gives you simple, yet effective tools to manage it with ease. There are a few concepts you need to understand in order to configure your site adequately: * [Tax Categories](#tax-categories) * [Zones](#zones) * [Tax Rates](#tax-rates) ## Tax Categories Tax Categories is Solidus's way of grouping products into those which are taxed in the same way. This is behind-the-scenes functionality; the customer never sees the category a product is in. They only see the amount they will be charged based on their order's delivery address. To access your store's existing Tax Categories, go to your Admin Interface, click \"Configuration\" then \"Tax Categories\". ![Tax Categories](/images/user/config/tax_categories.jpg) You can edit existing Tax Categories by clicking the \"Edit\" icon next to each in the list. ![Edit Tax Category Link](/images/user/config/edit_tax_category_link.jpg) You can also remove a Tax Category by clicking the \"Delete\" icon next to the category, then clicking \"OK\" to confirm. ![Delete Tax Category Link](/images/user/config/delete_tax_category_link.jpg) To create a new Tax Category, click the \"New Tax Category\" button. ![New Tax Category Form](/images/user/config/new_tax_category_form.jpg) You supply a name, an optional description, and whether or not this is the default tax category for this store. Each product in your store will need a tax category assigned to it to accurately calculate the tax due on an order. Any product that does not have a tax category assigned will be put in the default tax category. If there is no default tax category set, the item will be treated as non-taxable. ## Zones In addition to a product's tax category, the zone an order is being shipped to will play a role in determining the tax amount. You can read more about how zones work in the [Zones guide](zones). ## Tax Rates Tax rates are how it all comes together. A product with a given [Tax Category](#tax-categories), being shipped to a particular [Zone](#zones), will accrue tax charges based on the relevant tax rate that you create. To add a new Tax Rate, go to your Admin Interface. Click \"Configuration\" then \"Tax Rates\". ![Tax Rates](/images/user/config/tax_rates.jpg) Here, you can see all of your existing tax rates and how they are configured. To create a new tax rate, click the \"New Tax Rate\" button. ![New Tax Rate](/images/user/config/new_tax_rate.jpg) * **Name** - Give your new tax rate a meaningful name (like \"Taxable US Goods\", for example) * **Zone** - You'll need to make separate tax rates for each zone you serve, per category. Suppose you have a \"Clothing\" tax category, and you sell to both the US and Europe. You'll need to make two different tax rates - one for the US zone, and one for the European zone. * **Rate** - The actual percentage amount you are charging. 8% would be expressed as .08 in this field. * **Tax Category** - The [tax category](#tax-categories) that relates to this tax rate. * **Included in Price** - Check this box if you have already added the cost of tax into the price of the items. * **Show Rate in Label** - When this box is checked, order summaries will include the tax rate, not just the tax amount. * **Calculator** - By default, Solidus uses the Default Tax calculator (a simple tax rate times item price adjusted for any promotions) calculation to determine tax. If you need something more specific or customized than this, it can be done - you'll just need to work with your development team to make it happen. ## Tax Settings Finally, European stores will benefit from the Tax Settings page. ![Tax Settings](/images/user/config/tax_settings.jpg) When this option is checked, your Solidus site will take its default [tax category](#tax_categories), find the corresponding [tax rate](#tax-rate), and multiply it times the shipping rate for each available [shipping method](shipping_methods) offered to a customer during checkout."},{"title":"Taxonomies","url":"/solidus-guides/users/configuration/configuring_taxonomies/","tags":[],"body":"## Introduction Taxonomies are the Solidus system's approach to category trees. The heading of a tree is called a _Taxonomy_. Any child branches are called _Taxons_. Taxons themselves can have their own branches. So you could have something like the following categories structure: ![Taxonomy Tree](/images/user/config/taxonomy_tree.jpg) In this example, \"Categories\" is the name of the Taxonomy. It has three child branches - \"Luggage\", \"Housewares\", and \"Clothing\". The last two branches each have three of their own child branches. Thus, \"Clothing\" is a child taxon to \"Categories\" and a parent taxon to \"Men's\". To reach the Taxonomies list, first go to your Admin Interface, then click \"Configurations\" and \"Taxonomies\". ### Create a New Taxonomy To create a new taxonomy, click the \"New Taxonomy\" button. Enter a name for the taxonomy and click \"Create\". ![New Taxonomy](/images/user/config/new_taxonomy.jpg) You can then [add child taxons](#adding-a-taxon-to-a-taxonomy) to your new taxonomy. ### Edit a Taxonomy To edit an existing taxonomy, click the \"Edit\" icon next to the name in the Taxonomies list. ![Edit Taxonomy Icon](/images/user/config/edit_taxonomy_icon.jpg) Here, you can change the name of the Taxonomy. You can also [reorder the child taxons](#reorder-a-taxon), [delete a taxon](#delete-a-taxon), [add a new taxon](#adding-a-taxon-to-a-taxonomy), or [edit a taxon](#edit-a-taxon). Make your changes, then click the Update button. ![Edit Taxonomy](/images/user/config/edit_taxonomy.jpg) ### Delete a Taxonomy ![Delete Taxonomy Icon](/images/user/config/delete_taxonomy_icon.jpg) To delete a taxonomy, click the \"Delete\" icon next to the name in the Taxonomies list. Click \"OK\" to confirm. ### Adding a Taxon to a Taxonomy Once you have created a taxonomy, you may want to add child taxons to it. Do do this, right-click the name of the Taxonomy, and click \"Add\". ![Add Taxon to Taxonomy](/images/user/config/add_taxon_to_taxonomy.jpg) This will cause a new input field to open up, with \"New node\" in it. Replace this text with the name of your new taxon, and hit Enter. You'll now see the child tax in the taxonomy tree. ![New Taxon](/images/user/config/new_taxon.jpg) Click \"Update\" to save your addition. ### Adding a Taxon to Another Taxon If your site needs sub-trees, just add taxons to other taxons. To do so, right-click the name of what will become the parent taxon, and click Add. ![Add Taxon to Another Taxon](/images/user/config/add_taxon_to_taxon.jpg) Enter the name of the child taxon and click enter. Repeat this process for any sub-trees you need. ![Complex Taxonomy Tree](/images/user/config/complex_taxonomy_tree.jpg) Remember to save your changes by clicking the \"Update\" button after you have added any taxons. *** When you navigate away from your taxonomy's page, then navigate back to it, sub-trees will be collapsed by default. To see child taxons, just click the arrow next to the parent taxon. *** ### Reorder a Taxon Taxons are displayed in the order you add them by default. To reorder them, just drag and drop them to their correct location in the tree. Let's assume, for example, that we want the \"Children's\" taxon to be listed first, above \"Women's\" and \"Men's\". Just drag and drop the taxon to its new location. ![Reordering Taxons](/images/user/config/reorder_taxons.jpg) You can even drag a parent taxon into the tree of a different parent taxon, merging it into the second taxon's sub-tree. ![Parent-to-Parent Taxon Merge](/images/user/config/parent_into_parent_taxon_merge.jpg) ### Edit a Taxon To edit a taxon's name, just right-click it and click \"Edit\". ![Edit Taxon Form](/images/user/config/edit_taxon.jpg) Here, you can edit several aspects of the taxon: * **Name** - A required field for all taxons. The name determines what the user will see when they look at this product in your store. * **Permalink** - The end of the URL a user goes to, in order to see all products associated with this taxon. This field is also required, and a value is automatically generated for you when you create the taxon. Be careful with arbitrarily changing the permalink - if you have two taxons with the same permalink you will run into issues. * **Icon** - This option is currently not functional. * **Meta Title** - Overrides the store's setting for page title when a user visits the taxon's page on the front end of the website. * **Meta Description** - Overrides the store's setting for meta description when a user visits the taxon's page on the front end of the website. * **Meta Keywords** - Overrides the store's setting for meta keywords when a user visits the taxon's page on the front end of the website. * **Description** - This option is currently not functional. Remember to click \"Update\" after you make your changes. ### Delete a Taxon To delete a taxon, right-click it in the taxonomy tree and click \"Remove\". ![Remove a Taxon](/images/user/config/remove_taxon.jpg) Click \"OK\" to confirm. ### Associating Products with Taxons To associate a product with one or more taxons, go to the Admin Interface, and click the \"Products\" tab. Locate the product you want to edit, and click its \"Edit\" icon. Select the taxons for the product in the Taxons field. ![Add Taxons to a Product](/images/user/config/add_taxons_to_product.jpg)"},{"title":"Orders","url":"/solidus-guides/users/orders/","tags":[],"body":"## Orders Much of your time administering your Solidus store will be spent manipulating customer orders - processing payments, issuing refunds, confirming shipments, etc. In these guides, you will learn how to: * [Process orders](processing_orders) (capture payments, record shipments) * [Manually enter an order](entering_orders) * [Edit an order](editing_orders) * [Understand the states an order goes through](order_states) * [Process the return of an order](returning_orders) * [Search through your orders](searching_orders)"},{"title":"Editing an Order","url":"/solidus-guides/users/orders/editing_orders/","tags":[],"body":"## Introduction There will come times when you need to edit orders that are placed in your store. Some examples: * A customer may call you to adjust the quantity of items they want to purchase. * You may sell out of an item and need to remove it from an item altogether. * You may need to change the shipping being charged on an order. * The customer holds a store credit you need to manually apply to their order. ## Editing an Order First, go to your Admin Interface. Click the \"Orders\" tab, and [locate the order]({{ site.baseurl }}/users/orders/searching_orders) you want to change. ![Edit Order Link]({{ site.baseurl }}/assets/img/users/orders/edit_order_link.png) This will bring up the order edit page: ![Order Edit Page]({{ site.baseurl }}/assets/img/users/orders/order_edit.png) You can change any of the following components of an order from here: * [The types and quantities of products]({{ site.baseurl }}/users/orders/entering_orders#add-products) * [Shipping method]({{ site.baseurl }}/users/orders/entering_orders#shipments) * Tracking details for shipments * [Customer information]({{ site.baseurl }}/users/orders/entering_orders#customer-details) * [Adjustments]({{ site.baseurl }}/users/orders/entering_orders#adjustments) * [Payment information]({{ site.baseurl }}/users/orders/entering_orders#payments) * [Return authorizations]({{ site.baseurl }}/users/orders/returning_orders)"},{"title":"Manual Order Entry","url":"/solidus-guides/users/orders/entering_orders/","tags":[],"body":"## Introduction An order can be created one of two ways: 1. An order is generated when a customer purchases an item from your store. 2. An order can be created manually from the Admin Interface for your store. This guide covers how to create a manual order from the Admin Interface. ## Add Products To create a new manual order, go into the Admin Interface, click the \"Orders\" tab, and click the \"New Order\" button. ![Create New Order]({{ site.baseurl }}/assets/img/users/orders/create_new_order.png) Type the name of the product you would like to add to the order in the search field. A list of matching product and variant combinations will return in the drop-down menu. Select the product/variant option you want to add to the order. ![Create New Order]({{ site.baseurl }}/assets/img/users/orders/order_product_search.png) The system will tell you how many of that product/variant you currently have on hand. Enter the quantity to add to the new order, and click the \"Add\" icon next to the item. The system creates the order and shows you the line items in it. ![Manual Order With Product]({{ site.baseurl }}/assets/img/users/orders/manual_order_with_product.png) Follow the same steps to add more products to the order. ## Customer Details Click the \"Customer\" link. You can either select a name from the \"Customer Search\" field if the customer has ordered from you before, or you can enter the customer's email address in the \"Email\" field of the \"Account\" section. The setting for \"Guest Checkout\" will automatically change accordingly. Enter the customer's billing address and the shipping address for the order. You can click the \"USE BILLING ADDRESS\" checkbox to use the same address for both. If you do so, the shipping address fields will become invisible. ![Enter Customer Details]({{ site.baseurl }}/assets/img/users/orders/order_customer_details.png) Click the \"Update\" button. ## Shipments After you input the customer information, you will want to choose a shipping method. To do so, click the \"Shipments\" link. The default shipping method for your store (if you have one) should already be assigned to this order. Depending on the items you added and the location you're shipping to, there could be additional methods available. You may also have shipping methods that are only available for your site's administrator to assign (in-store pickup, for example). Click the \"Edit\" link next to the order's shipping line. ![Edit Order Shipping Info]({{ site.baseurl }}/assets/img/users/orders/edit_shipping_on_order_link.png) Click the \"Shipping Method\" drop-down menu, and make your selection. ![Edit Shipping Options]({{ site.baseurl }}/assets/img/users/orders/edit_shipping_options.png) Click the \"Save\" icon to confirm your change. Your Solidus site will re-calculate the shipping, any relevant adjustments, and total for your order. ## Adjustments The Solidus shopping cart will automatically add the cost of the Shipping Method to your order as an adjustment - you can change or remove this. You can also add a coupon code here as well. ### Editing Adjustments To edit an existing order adjustment, just click the \"Adjustments\" link in the order summary, then click the \"Edit\" icon next to the adjustment in the Adjustments list. Enter in the amount of the adjustment and reason and click continue. When finished click finalize adjustments. ![Edit Adjustment Icon]({{ site.baseurl }}/assets/img/users/orders/edit_adjustment_icon.png) ### Deleting Adjustments To remove an adjustment, click the \"Delete\" icon next to it in the Adjustments list. ![Delete Adjustment Icon]({{ site.baseurl }}/assets/img/users/orders/delete_adjustment_icon.png) Confirm the deletion by clicking \"OK\". ### Opening and Closing Adjustments Some types of adjustments - tax and shipping, for example - may re-calculate as the order changes, new products are added to it, etc. If you want to be sure that the amount of an adjustment will remain the same, you can lock it in place. This is also known as closing the adjustment. *** Finalized adjustments can be re-opened and changed, up to the moment when the order is shipped. At that point, the adjustment is finalized and cannot be changed. *** Doing so will change the state of the adjustment to \"closed\", and that change will then be reflected in the adjustments list. If you want to open or close all of the adjustments on an order, just click the \"Unfinalize All Adjustments\" or \"Finalize All Adjustments\" buttons on the Adjustments list. ![Mass Open and Close Adjustments]({{ site.baseurl }}/assets/img/users/orders/mass_open_close_adjustments.png) ### Adding Adjustments You can also add further adjustments - positive or negative - to the order to account for things like handling charges, store credits, etc. To add a new adjustment, click the \"New Adjustment\" button at the top right corner. ![New Adjustment Button]({{ site.baseurl }}/assets/img/users/orders/new_adjustment_button.png) You need only enter the \"Amount\" (positive for a charge on the order; negative for a credit) and a \"Description\", then click the \"Continue\" button. For a fuller understanding of adjustments, please read the [Developer Adjustments Guide]({{ site.baseurl }}/developer/adjustments). Once you have finished all of the changes you want to the order's Adjustments, click \"Continue\". ## Payments If you are manually entering this order, it is presumed that you have received payment either in person, on the phone, or through some other non-website means. You can manually enter payment using any of your site's configured [payment methods]({{site.baseurl}}/users/payments/payment_methods). Just click the \"Payments\" link in the \"Order Information\" section. ![Payments Link]({{ site.baseurl }}/assets/img/users/orders/payments_link.png) This form is pretty self-explanatory; you enter the amount of the payment, the method, and the credit card information (if applicable). One thing to note is that you can enter multiple payments on the same order. This is useful if, for example, a customer wants to pay part of their order in cash and put the rest on a credit card. In that case, all you have to do is create the first payment for the Cash amount, check the \"Cash\" payment method (be sure you have it configured in your store first!), and click Update. Then, click the \"New Payment\" link to enter the information for the credit card portion of the payment. ![New Payment Method Link]({{ site.baseurl }}/assets/img/users/orders/new_payment_method_link.png) Don't forget that you will need to [capture the payment]({{ site.baseurl }}/users/payments/payment_states#authorize-vs-capture) on the credit card (unless your store is set up to automatically authorize and capture a payment when it is made). For more on payments, be sure to read both the [Payment Methods]({{ site.baseurl }}/users/payments/payment_methods) and [Payment States]({{ site.baseurl }}/users/payments/payment_states) guides."},{"title":"Order States","url":"/solidus-guides/users/orders/order_states/","tags":[],"body":"## Introduction A new order is initiated when a customer places a product in their shopping cart. The order then passes through several states before it is considered `complete`. The order states are listed below. An order cannot continue to the next state until the previous state has been successfully satisfied. For example, an order cannot proceed to the `delivery` state until the customer has provided their billing and shipping address for the order during the `address` state. ## Order States The states that an order passes through are as follows: * `cart` - One or more products have been added to the shopping cart. * `address` - The store is ready to receive the billing and shipping address information for the order. * `delivery` - The store is ready to receive the shipping method for the order. * `payment` - The store is ready to receive the payment information for the order. * `confirm` - The order is ready for a final review by the customer before being processed. * `complete` - The order has successfully completed all of the previous states and is now being processed. *** The states described above are the default settings for a Solidus store. You can customize the order states to suit your needs utilizing our API. This includes adding, removing, or changing the order of certain states. Customization details are provided in the [Checkout Flow API Guide]({{ site.baseurl}}/developer/checkout.html#checkout-customization). ***"},{"title":"Processing Orders","url":"/solidus-guides/users/orders/processing_orders/","tags":[],"body":"## Introduction Once an order comes into your store - whether it is entered by a customer through the website frontend or you [manually enter it yourself]({{site.baseurl}}/users/orders/entering_orders) through the admin backend - it needs to be processed. That means these steps need to be taken: 1. Verify that the products are, in fact, in stock and shippable. 2. Process the payment(s) on the order. 3. Package and ship the order. 4. Record the shipment information on the order. Steps 1 and 3 you would obviously do physically at your stocking location(s). This guide covers how you use your Solidus store to manage steps 2 and 4. ## Processing Payments You have received an order in your store - hooray! Either the items are all in stock, or you have adjusted the order to include only those items you can sell to the customer. Now you need to process the payment on the order. You know best how your store processes things like checks, money orders, and cash, so this guide will focus on processing credit card payments. ![Order to Process]({{site.baseurl}}/assets/img/users/orders/order_to_process.png) Pictured above is an order that is ripe for processing. The current order State is \"Complete\", meaning that all of the information the customer needs to provide is present. The Payment State is \"Balance Due\", meaning that there is an unpaid balance on the order. The Shipment State is \"Pending\", because you can't ship an order before you collect payment on it. If you click either the Order Number or the \"Edit\" icon, you will open the order in Edit mode. Instead, click the \"Balance Due\" payment state to open the order's payment info page. ## Approving Payment ![Payment to Process]({{site.baseurl}}/assets/img/users/orders/payment_to_process.png) As you can see above, we have only a single payment to process, for the full amount ($22.04). Processing this payment is literally a click away - just click on the the \"Payments Tab\" and then click \"Capture\" icon next payment. If the payment is processed successfully, the page will re-load, showing you that the payment state has progressed from \"Pending\" to \"Completed\". ![Completed Payment]({{site.baseurl}}/assets/img/users/orders/completed_payment.png) That's it! Now you can prepare your packages for shipment, then update the order with the shipment information. ## Processing Shipments Now, when you visit the Order Summary, you can see that there is a new \"Ship\" button in the middle of the page. The only thing that remains to do now is to click the \"Edit\" icon next to the tracking details line, and provide tracking info for the package(s). Click the \"Save\" icon to record this information. ![Input Tracking Info]({{site.baseurl}}/assets/img/users/orders/tracking_input.png) Note that you must enter the tracking information before clicking \"SHIP\". ![Ship Button]({{site.baseurl}}/assets/img/users/orders/ship_it.png) Clicking this button moves the Shipment State from \"Ready\" to \"Shipped\". ![Order Marked Shipped]({{site.baseurl}}/assets/img/users/orders/order_shipped.png)"},{"title":"Returns","url":"/solidus-guides/users/orders/returning_orders/","tags":[],"body":"Introduction Returns are a reality of doing business for most e-commerce sites. A customer may find that the item they ordered doesn't fit, or that it doesn't fit their needs. The product may be damaged in shipping. There are many reasons why a customer could choose to return an item they purchased in your store. This guide covers how you, as the site administrator, issue RMAs (Return Merchandise Authorizations) and process returns. Creating RMAs for Returns You can only create RMAs for orders that have already been shipped. That makes sense, as you wouldn't authorize a return for something you haven't sent out yet. To create an RMA for a shipped order, click the order's \"RMA\" link, then click the \"New Return Authorization\" button at the top of the page. The form that opens up enables you to select which items will be authorized to be returned, and issue an RMA for the corresponding amount. To use it, just select each line item to be returned, and either a reimbursement type or exchange item. Selecting the \"Original\" reimbursement type will refund a user back to their original payment method when the items are returned and approved. Selecting an exchange item will create a new shipment to ship the exchange item to the customer. The form will automatically calculate the RMA value based on the sale price of the item(s), but you will have to confirm the amount when the reimbursement is issued. This gives you a chance to adjust for handling fees, restocking fees, damages, etc. Input the reason and any memo notes for the return, and select the Stock Location the item is coming back to. Click the \"Create\" button. Now you just need to wait for the package to be received at your location. Processing Returns Once you receive a return package, you need to create a \"Customer Return\". To do so, go to the order in question and click \"Customer Returns\". Click the \"New Customer Return\" button. Select which of the authorized return items were received, and to which Stock Location. Once done click the \"Create\" button. The return items are marked as accepted, and now you can create a reimbursement for the $22.99 you owe the customer. The reimbursement form will be populated according to your original reimbursement or exchange selections chosen during the return authorization form. You may override the selected reimbursement type or exchange item now if you would like, otherwise click the \"Reimburse\" button to create the refund. Your return-processing is complete! As you can see there will now be a $22.99 refund issued to the original credit card."},{"title":"Searching Orders","url":"/solidus-guides/users/orders/searching_orders/","tags":[],"body":"When you click the **Orders** tab on the Admin Interface, you are instantly presented with a summary of the most recent orders your store has received. ![Initial List of Orders]({{ site.baseurl }}/assets/img/users/orders/order_listing.png) The list shows you the following information about each order: * **Completed At** - The date on which the user finalized their order. * **Number** - The Solidus-generated order number. * **State** - The current state of the order. * **Payment State** - Solidus tracks the state of an order's payment separately from the state of the order itself. As payment is received, the state of the order progresses. * **Shipment State** - Having the Shipment State pictured separately lets you quickly see which orders are paid and need to be packed and shipped, improving your store's workflow. * **Customer Email** * **Total** - This amount includes item totals, tax, shipping, and any promotions or adjustments made to the order. Next to each row is an \"Edit\" icon. Clicking this icon allows you to [make changes to an order]({{ site.baseurl }}/users/orders/editing_orders). # Filtering Results You may not always want to see all of the most recent orders - the Solidus default. You may want to view only those orders that you need to pack and ship, or only those from a particular customer. Solidus gives you the flexibility to quickly find only those orders you need. ![Order Filter Options]({{ site.baseurl }}/assets/img/users/orders/filter_options.png) You can choose one or more of the following options to narrow your order search, then click the **Filter Results** button to update the results. ## Date Range You can input a **Start** and/or **Stop** date. If you enter both, the results shown will be all orders that fall on or between those dates. If you input only a **Start** date, you will get all orders placed on or after that date. If you input only a **Stop** date, the results will include all orders placed up to and on that date. ## Status You can restrict orders to only those with a particular status. Available status options include: * **cart** - Customer has added items to a shopping cart, but has not yet checked out. * **address** - Customer has entered the checkout process, but has not yet completed input of shipping and/or billing address(es). * **delivery** - Customer has completed entry of addresses, but has not yet completed selection of delivery method(s). * **payment** - Customer has entered addresses and chosen a delivery method, but still needs to enter a payment method. * **confirm** - All required information has been entered; customer just needs to confirm the order. * **complete** - All required information is present, customer has confirmed the order, payment has not yet been received or processed. * **canceled** - Either customer or store admin has chosen to cancel the order. * **awaiting return** - Customer has elected to return products, but they have not yet been received. * **return** - A return has been processed. * **resumed** - A formerly canceled order has been reactivated. ## Order Number Solidus generates a unique order number for each order when the first item is added to a shopping cart. Order numbers begin with the letter R, followed by 9 random numbers. If you are searching for a particular order, you can just input the entire order number and that order is all that will be returned. ## Email At this time, the filter does not allow you to search for only part of an email address. If you want to find all orders from `jane_doe@example.com`, you will have to use the full address. Inputting only \"jane_doe\" will result in a pop-up alert to enter a valid email address. ## Name The **First Name Begins With** and **Last Name Begins With** fields will let you filter order results based on the *billing address*, not on the shipping address. You can use any number of letters, from just an initial to the full first and/or last name. ## Complete By default, the filter restricts results to only orders that have reached the `complete` order state. To remove this restriction, uncheck the box that is marked **Only Show Complete Orders**. ## Unfulfilled If you only want to review orders that have not been shipped, you can check the box marked **Show Only Unfulfilled Orders**."},{"title":"Payments","url":"/solidus-guides/users/payments/","tags":[],"body":"## Payments Processing payments for orders is a very important component of your Solidus store. The flexibility of this system allows you to add, remove, or change [methods of payment](payment_methods) to suit your needs, as well as to use almost any [payment gateway](payment_methods#add-a-supported-gateway) you prefer. The guides in this section will also help you to understand the [states an order goes through](payment_states) from the time the first item is added to the cart, to the time you close out the fulfillment process."},{"title":"Payment Methods","url":"/solidus-guides/users/payments/payment_methods/","tags":[],"body":"## Introduction Payment methods represent the different payment options available to customers during the checkout process on an e-commerce store. Solidus supports many types of payment methods, including both online and offline options. This guide describes how to add payment methods to your Solidus store. ## Terminology Let's begin by explaining the difference between a Payment Gateway and a Merchant Account. **Payment Gateway** - A payment gateway is a service that authorizes credit card payments, processes them securely, and deposits the funds into your bank account. A payment gateway performs the same functions as a credit card swipe machine at a restaurant or retail store, it just performs these functions for purchases made online instead of in person. **Merchant Account** - A merchant account is a type of bank account that allows you to accept credit card payments online. If you have a retail business and already accept credit card payments, then more than likely you have a merchant account. When you start to sell products online, you may need to call your bank and ask that they set you up with an _Internet_ merchant account. An Internet merchant account allows you to accept payments online without having the customer's credit card physically in front of you. ## Evaluating Payment Gateways When researching payment gateway options, you may find that they offer an all-in-one solution that includes both the gateway and the merchant account. This is just something to be aware of and to evaluate if it makes sense for your store. Payment gateways also charge a fee for their services. Here are a few of the fees you might come across when evaluating providers: **Setup Fee** - A one-time charge to set up your payment gateway account. **Recurring Fixed Monthly Fees** - A fixed monthly fee that a payment gateway provider charges for access to their services and reports. Some gateways break this charge down further into a monthly Gateway Fee and a Statement Fee. **Transaction Fees** - A charge for each purchase made on your e-commerce store. The pricing structure for these fees differ per gateway. A popular structure is to charge a percentage of the purchase price plus a flat fee. For example, 2.9% of the purchase price plus $0.30 per transaction. ## Add a Payment Method Solidus enables you to utilize the payment method of choice for your e-commerce store. We have two [preferred payment gateway partners](http://Soliduscommerce.com/products/payment_processing) and a long [list](https://github.com/Shopify/active_merchant#supported-direct-payment-gateways) of payment gateways that are supported by default in Solidus. We also enable you to add a custom payment gateway, as well as offer offline payment options such as checks and purchase orders. ### Add a Supported Gateway Read through the following explanatory text to add one of the supported payment gateways as a payment method on your store. #### Select Provider To configure one of the supported payment gateways, you must first install the [Solidus_Gateway](https://github.com/Solidus/Solidus_gateway) extension on your store. More than likely, you will want to ask someone from your technical team to do this. Once this extension has been installed, you can configure one of the supported gateways in the Admin Interface by clicking the \"Configuration\" tab and then clicking the \"New Payment Method\" button. ![New Payment Method Form](/images/user/payments/new_payment_method.jpg) If you installed the [Solidus_Gateway](https://github.com/Solidus/Solidus_gateway) extension, you will see a long list of gateways in the \"Provider\" drop down menu. Select the one that you would like to add. ![Select Payment Gateway Provider](/images/user/payments/add_payment_provider.jpg) #### Display Select whether you want the payment method to appear on the Frontend or the Backend of your store, or both. The Frontend is the customer-facing area of your store, meaning that the payment method will display as a payment option to your customers during the checkout step. The Backend is the Admin Interface for your store. Site administrators typically select this option when they want to make a payment option available to their internal staff but not to their end customers. For example, you might want to offer purchase orders as a payment option to customers on a one-off basis, but only if they contact one of your customer service representatives via email or telephone. #### Active Select \"Yes\" if you want the payment method to be active on your store. Select \"No\" if you want to create the payment method, but not present it on your store until a later point. #### Name Give the payment method a name. The value you enter will appear on the customer-facing area of your store, on the Payment page as seen below: ![Payment Method Name](/images/user/payments/payment_method_name.jpg) #### Description Add a description for the payment method. This field is optional and is only displayed to internal users and not to customers. Click \"Update\" once you've input the desired settings for your new payment method. ### Add a Non-Supported Gateway It is possible to add a new payment gateway that is not included on the supported by default gateway [list](https://github.com/Shopify/active_merchant#supported-direct-payment-gateways), but doing so is outside the scope of this tutorial. Please consult with your development team if you need this functionality. ## Edit a Payment Method To edit the configuration settings for an existing payment method, go to the Admin Interface, click the \"Configuration\" tab, and then click the \"Payment Methods\" link. Find the payment method that you would like to edit on the list that appears. Click the \"Edit\" icon next to the payment method to edit its settings. ![Edit Payment Method](/images/user/payments/edit_payment_method.jpg) Make the desired changes to the payment method settings and then click \"Update\" to save them. ## Processing Payments Processing orders and the payments associated with them are covered in detail in the [Processing Orders guide](processing_orders)."},{"title":"Payment States","url":"/solidus-guides/users/payments/payment_states/","tags":[],"body":"## Introduction When an order is initiated for a customer purchase a payment is created in the Solidus system. A payment goes through various states while being processed. ## Payment States The possible payment states are: * **Checkout** - The checkout has not been completed. * **Processing** - The payment is being processed. * **Pending** - The payment has been processed but is not yet complete (ex. authorized but not captured). * **Failed** - The payment was rejected (ex. credit card was declined). * **Void** - The payment should not be applied against the order. * **Completed** - The payment is completed. Only payments in this state count against the order total. A payment does not necessarily go through each of these states in sequential order as illustrated below: ![Payments Flow](/images/developer/core/payment_flow.jpg) You can determine the payment state for a particular order by going to the Admin Interface and clicking on the \"Orders\" tab. Find the order you want to look up and click on it. Then click on the \"Payments\" link. ![Payment Look Up](/images/user/payments/payments_look_up.jpg) The details for the payment will appear. The \"Payment State\" column will display one of the possible payment states listed above. ![Payment Details](/images/user/payments/payment_details.jpg) ## Authorize vs Capture Authorizing a payment is the process of confirming the availability of funds for a transaction with the purchaser's credit card company. Capturing a payment is the process of telling the credit card company that you would like to get paid for the transaction amount. Typically, this two step process of first authorizing the payment and then capturing the payment is used by online retailers to delay charging the customer until the product(s) purchased are fulfilled (shipped). By default, Solidus automatically handles authorizing the payment for a transaction. For capturing payments, we give you the choice of auto-capturing the payment or manually capturing the payment via the Admin Interface. If you like, you can read further [documentation about auto-capturing payments](/developer/payments#auto-capturing). Note: Not all payment gateways allow for the two step *authorize and then capture* payment process. If this functionality is required for your store, please confirm with your payment gateway that they can support this process. # Capture a Payment via the Admin To capture a payment using the Admin Interface, click on the \"Orders\" tab. Find the order you want to look up and click on it. Then click on the \"Payments\" link. The order details will appear. Click on the \"Capture\" icon to initiate the capture process. ![Capture a Payment](/images/user/payments/payment_capture.jpg) ## Void a Payment To void a payment, go to the Admin Interface. click on the \"Orders\" tab. Find the order you want to look up and click on it. Then click on the \"Payments\" link. The order details will appear. Click on the \"Void\" icon to void the transaction. ![Void a Payment](/images/user/payments/payment_void.jpg)"},{"title":"Products","url":"/solidus-guides/users/products/","tags":[],"body":"## Products Products are at the core of any e-commerce site. Selling them is the whole reason behind opening a store in the first place. From your store's Admin Interface, you can manage all of the common tasks associated with managing your products. To reach the Admin Interface, first log into your store with your admin user account, then go to the `/admin` directory of your site. Click the \"Products\" tab. ![Products Admin](/images/user/products/products_admin.jpg) From here you can: * [Create New Products](creating_products) * [Delete Existing Products](deleting_products) * [Edit Existing Products](editing_products) * [Clone Existing Products](cloning_products) * [Search Existing Products](searching_products) In addition, you can set up new [Product Option Types and Values](product_options); add, edit, and remove [Product Properties](product_properties); and work with [Product Prototypes](product_prototypes)."},{"title":"Cloning Products","url":"/solidus-guides/users/products/cloning_products/","tags":[],"body":"## Introduction To clone a product in your store, go into the Admin Interface and click the \"Products\" tab. A list of your store's product inventory will appear. Find the product that you would like to clone and click the \"Clone\" icon to make a copy of it. ![Cloning a Product](/images/user/products/clone_product.jpg) This will create a copy of the product and it will now appear in your product inventory list as \"COPY OF\" with the product name appended afterward. A new permalink and SKU will also be created for the product. ![Cloned Product Example](/images/user/products/example_cloned_product.jpg) ## Editing You may want to change the name of the product to remove the \"COPY OF\" text and to rename the permalink and SKU so it matches your product name. !!! Be very careful in assigning arbitrary permalinks, so that you don't accidentally assign two products the same permalink. !!! You can edit the information associated with a cloned product just like you would for any other product. To do this, click on the product from your inventory list. In the \"Name\" field, delete the \"COPY OF\" text. To modify the permalink name, enter your desired value in the \"Permalink\" field. To modify the product SKU, enter your desired value in the \"SKU\" field. Once you've made your changes, scroll to the bottom of the page and click \"Update\". ![Editing a Cloned Product](/images/user/products/edit_cloned_product.jpg)"},{"title":"Creating a New Product","url":"/solidus-guides/users/products/creating_products/","tags":[],"body":"## Introduction To create a new product for your store, go into the Admin Interface, click the \"Products\" tab, and click the \"New Product\" button. ![New Product Entry Form](/images/user/products/new_product_entry_form.jpg) The two mandatory fields (\"Name\" and \"Master Price\") are denoted with an asterisk (*) next to the label. You can leave SKU blank. If you don't add a value for \"Available On\" the product will not be shown in your store. *** [Prototypes](product_prototypes) are a more complex topic, and are covered in their own guide. *** ## Product Details After you click the \"Create\" button, the Solidus application brings you to a more detailed product entry page, where you can input more information about your new product. ![Product Edit Form](/images/user/products/product_edit_form.jpg) * **Name** - This field will either be blank, or the same as what you entered on the initial page. You can change this field whenever you like. * **Permalink** - The permalink is automatically created by the application for you when the product is first saved, and is based on the product's name. This is what is appended to the end of a URL when someone visits the page for a particular product. You can change the permalink, but should exercise extreme caution in doing so to avoid naming collisions with other products in your database. * **Description** - This is where you will provide a detailed description of the product and its features. The application gives you plenty of room to be thorough. * **Master Price** - For now, just think about the Master Price as the price you charge someone to buy the item. Later in this guide, you will learn more about variants and how they impact a product's actual price. * **Cost Price** - What the item costs you, the seller, to purchase or produce. * **Cost Currency** - It may be that the currency used when you purchased the product is not the same as that you use in your store. Solidus makes these conversions for you - just enter the code for the currency used in acquiring your inventory. * **Available On** - This field will either be blank, or the same as what you entered on the initial page. You can change this field whenever you like. * **SKU** - This field will either be blank, or the same as what you entered on the initial page. You can change this field whenever you like. * **Weight** - The product's weight in ounces. May be used to calculate shipping cost. * **Height** - The product's height in inches. May be used to calculate shipping cost. * **Width** - The product's width in inches. May be used to calculate shipping cost. * **Depth** - The product's depth or breadth in inches. May be used to calculate shipping cost. * **Shipping Categories** - You will learn about setting up Shipping Categories in the [Shipping Categories](shipping_categories). * **Tax Category** - You will learn about setting up Tax Categories in the [Taxes Guide](configuring_taxes). * **Taxons** - Taxons are basically like categories. You will learn more about them in the [Taxonomies Guide](configuring_taxonomies). * **Option Types** - You can select any number of Options to associate your new product with. You'll learn more about Options in the [Options Guide](product_options). * **Meta Keywords** - These words are appended to the website's keywords you established in the [Site Settings](configuring_general_settings) and can help improve your site's search engine ratings, bringing you more web traffic. They should be words that are key to your new product. * **Meta Description** - The summary that someone sees when your product's page is returned in a web search. It should be descriptive but not overly verbose. ## Images A store whose products had no images to look at would be pretty boring, and probably not garner a lot of sales. It would be very time-consuming to have to upload, crop, resize, and associate several photos to each product, if you had to do so manually. Luckily, Solidus makes maintaining images of your products quick and painless. Just click the \"Images\" link under \"Product Details\" on the right-hand side of the screen. Any images that you may have already uploaded will be previewed for you. To add a new image for your product, click the \"New Image\" button. ![New Product Image Form](/images/user/products/new_image_form.jpg) Select the Image file, and enter the Alternative Text for the image. Alternative Text is what appears when someone has their browser's image-rendering turned off, as with certain types of screen readers. You have the option to associate a photo only with a particular \"Variant\" (again, more on Variants later in this guide), or with all of the product's Variants. When you click Update, not only is the product photo uploaded, it is automatically resized and cropped to fit your store's requirements, and it is associated with the correct versions of your product. ## Understanding Variants Suppose that in your store, you sell drink tumblers. All of the tumblers are made by the same manufacturer and have the same basic product specifications (materials used, machine washability rating, etc.), but your inventory includes several options: * **Size** - You carry both Medium and Large tumblers * **Decorative Wrap** - Your tumblers come with the option of several kinds of decorative plastic wraps: Stars, Owls, Pink Paisley, Purple Paisley, or Skulls. * **Lid Color** - The tumblers also come with with an assortment of lids to match the decorative wrap - the Star tumblers have Blue lids, the Owls have Orange lids, the Pink Paisley have Pink lids, the Purple Paisley have White lids, and the Skulls can be purchased with White *or* Black lids. Given this inventory, you will need to create a Drink Tumbler _Product_, with three _Option Types_, the corresponding _Option Values_, and twelve _Variants_: Size | Wrap | Lid Color |-----|------|---------| Large | Stars | Blue Small | Stars | Blue Large | Owls | Orange Small | Owls | Orange Large | Pink Paisley | Pink Small | Pink Paisley | Pink Large | Purple Paisley | White Small | Purple Paisley | White Large | Skulls | White Large | Skulls | Black Small | Skulls | White Small | Skulls | Black The _Option Types_ you would create for this inventory are - Size, Wrap, and Lid Color - with the corresponding _Option Values_ below. Option Type | Option Values |-----------|--------------| Size | Large, Small Wrap | Stars, Owls, Pink Paisley, Purple Paisley, Skulls Lid Color | Blue, Orange, Pink, White, Black Read the [Product Options Guide](product_options) for directions on creating Option Types and Option Values. You must establish your Option Types and Option Values before you can set up your Variants. Don't forget to associate the Option Types with the Tumbler product so they'll be available to you when you make your Variants. ### Creating Variants Now that you have set up the appropriate options for your Product's Variants and associated those options with the product, you can create the Variants themselves. Let's create the large, star-wrapped, blue-lidded tumbler Variant as an example. You can then use the same approach to creating all of the other Variants we mentioned earlier. On your tumbler product edit page, click the \"Variants\" link. Click the \"New Variant\" button. ![New Product Variant](/images/user/products/new_variant.jpg) Select the appropriate values for the Option Types. As you can see, you also have the choice to enter values for this particular Variant that may be different from what you input on the Product's main page. Let's raise the price on our Variant to $20. Click the \"Create\" button. ![Variants List](/images/user/products/variants_list.jpg) ## Product Properties You can set as many individual product properties as you like. These include things like the item's country of manufacture, material(s) used, design style, etc. Typically, these are characteristics that do not change across variants of a product. You can read much more in-depth information about this feature in the [Product Properties Guide](product_properties). ## Stock Management As of version 2.0 of Solidus, you now have much more granular control over how inventory is tracked through your store. You will learn more about stock locations in the [Stock Locations Guide](stock_locations), but for now it's enough to understand that you enter the number of each product variant that you have at each of your individual stock locations. Let's assume that you have two stock locations - your main New York warehouse and your satellite Detroit warehouse. Refer to the instructions on creating stock locations in the [Stock Locations Guide](stock_locations#create-a-new-stock-location) to add your warehouses. Now, go back to the Tumblers product page, and click the \"Stock Management\" link. ![Stock Management Page](/images/user/products/stock_management.jpg) For this guide, let's say we want to say that we have 7 of our tumbler variant in the New York warehouse, and 3 in Detroit. To accomplish this, change the quantity to 7, select \"New York Warehouse\" from the \"Stock Location\" drop-down list, and select \"large-blue-stars\" from the \"Variant\" drop-down list. Click the \"Add Stock button\". The \"Stock Location Info\" table will update, showing you that there are 7 of these items in the New York warehouse. Repeat these steps, adding 3 tumblers from the Detroit warehouse. ![Stock Location Info](/images/user/products/stock_location_info.jpg) Your Stock Location Info table should now look like the one pictured above. *** \"Backorderable\" may or may not be checked for your individual Stock Locations, depending on how you configured them. Each Stock Location has defaults for this value, but you can change it on a variant-by-variant basis in this dialog. *** You should be sure to read the [Stock Locations](configuring_inventory.html#stock-locations) and [Stock Movements](configuring_inventory.html#stock-movements) guides for further information on managing your store's inventory."},{"title":"Deleting Products","url":"/solidus-guides/users/products/deleting_products/","tags":[],"body":"## Introduction To delete a product in your store, go into the Admin Interface and click the \"Products\" tab. A list of your store's product inventory will appear. Find the product that you would like to delete and click the \"Delete\" icon on the right to remove it from your store. ![Deleting a Product](/images/user/products/delete_products_icon.jpg) A message will appear asking you to confirm that you want to delete the product. Click \"OK\". ## Viewing Deleted products no longer appear in the customer-facing area of your store. However, they do remain in your product database. To view products that have been deleted from your store, go to the \"Products\" tab in the Admin Interface and find the \"Search\" section. Do not enter anything in the \"Name\" or \"SKU\" fields. Check the \"Show Deleted\" box and click \"Search\". The search results will return a list of your entire product inventory including active and deleted products. ![Search for Deleted Products](/images/user/products/show_deleted_products.jpg) ## Re-activating To re-activate a deleted product, find the product in your inventory following the steps [above](#viewing). Deleted products will only have the \"Clone\" icon next to them, whereas active products will have the \"Edit\", \"Clone\", and \"Delete\" icons next to them. Click the \"Clone\" icon to the right of the deleted product. ![Clone a Deleted Product](/images/user/products/clone_deleted_product.jpg) This will create a copy of the product, and it will now appear in your product inventory list as \"COPY OF\" with the product name appended afterward. A new permalink and SKU will also be created for the product. Follow the instructions from the [Cloning guide](cloning_products) to modify the information for this product."},{"title":"Editing Products","url":"/solidus-guides/users/products/editing_products/","tags":[],"body":"## Introduction You will often need to modify the products in your store - prices may fluctuate, descriptions may change, you may take new photographs of your inventory. Solidus makes it quick and easy to make such changes. ## Editing Products To make changes to your product, go to your Admin Interface, click the \"Products\" tab, and click the \"Edit\" icon next to the product. ![Edit Product Link](/images/user/products/edit_product_link.jpg) The edit form is the exact same one you use when [creating products](creating_products). See that guide for explanation of any of the fields when editing your product."},{"title":"Product Options","url":"/solidus-guides/users/products/product_options/","tags":[],"body":"## Option Types and Option Values Option Types are a way to help distinguish products in your store from one another. They are particularly useful when you have many products that are basically of the same general category (Tshirts or mugs, for example), but with characteristics that can vary, such as color, size, or logo. For each Option Type, you will need to create one or more corresponding Option Values. If you create a \"Size\" Option Type, then you would need Option Values for it like \"Small\", \"Medium\", and \"Large\". ### Creating Option Types and Option Values Option Types and Option Values are created at the store level, not the product level. This means that you only have to create each Option Type and Option Value once. Once an Option Type and Option Value is created it can be associated with any product in your store. To create an Option Type, click \"Products\", then \"Option Types\", then \"New Option Type\". ![New Option Type](/images/user/products/new_option_type.jpg) You are required to fill in two fields: \"Name\" and \"Presentation\". You will see this same pattern several places in the Admin Interface. \"Name\" generally is the short term (usually one or two words) for the option you want to store. \"Presentation\" is the wordier, more descriptive term that gives your site's visitors a little more detail. *** NOTE: Sometimes the term \"Display\" is used instead of \"Presentation\" to indicate what is shown to the user on the Product Variant's page. *** For our first Option Type - Size - enter \"Size\" for the Name and \"Size of the Tumbler\" as the Presentation. Click \"Update\". When the screen refreshes, you see that Solidus has helpfully provided you with a blank row in which you can enter your first Option Value for the new Option Type. ![New Option Value](/images/user/products/new_option_value.jpg) We're going to need two Option Values (Large and Small) for the Size Option Value, so go ahead and click the \"Add Option Value\" button. This gives you two blank rows to work with. \"Name\" is easy - \"Large\" for the first, and \"Small\" for the second. Let's input \"24-ounce cup\" in the \"Display\" field for the Large Option Value and \"16-ounce cup\" for the Small Option Value. ![Completed Option Values](/images/user/products/large_small_option_values.jpg) When you click \"Update\", Solidus saves the two new Option Values, associates them with the Size Option Type, and takes you to the list of all Option Types. ### Associating Option Values with a Product Our Solidus application now knows that we have an Option Type with corresponding Option Values,but it doesn't know which of our products should have those Option Types. We have to explicitly tell it about those associations. We can do so either when we create a new Product (if the options have already been created), or when we edit an existing product. At the bottom of the Product edit form is a text box labeled \"Option Types\". When you click in this box, a drop-down appears with all of the Option Types you have defined for your store. All you have to do is click one or more of them to associate them with your Product. ![Option Types Dropdown List](/images/user/products/option_types_dropdown.jpg) Don't forget to click \"Update\" to save your changes."},{"title":"Product Properties","url":"/solidus-guides/users/products/product_properties/","tags":[],"body":"## Product Properties Depending on the nature of your store and the products you sell, you may want to add \"Properties\" to your product descriptions. Properties are typically used to provide additional information about a product to help the customer make a better purchase decision. Here is an example of how a product's properties would display on the customer-facing area of a store: ![New Product Variant](/images/user/products/properties_example.jpg) ### Adding a Product Property Follow these steps to add a product Property. In this example, we are going to add a Property called \"Country of Origin\" with a value of \"USA\". 1. Click the \"Products\" tab in your Admin Interface. 2. Click \"Properties\". 3. Click the \"New Property\" button. 4. Enter values for the \"Name\" and \"Presentation\" fields, such as \"Origin\" and \"Country of Origin\", respectively. 5. Click the \"Create\" button. 6. Navigate to the edit page for one of the products in your store. 7. Click the \"Product Properties\" link. 8. Click in the empty text box field under \"Property\" and start typing the name of the property you want to use: \"Origin\". After you type a few letters, the property name will display, and you can click it to select it. 9. Enter a country name for the \"Value\" field, such as \"USA\". 10. Click \"Update\". Now, when you navigate to the product's page in your store, you will see the new Country of Origin property in the \"Properties\" list. ![Properties List](/images/user/products/properties_list.jpg) *** You can add as many \"Product Properties\" to an individual \"Product\" as you like - just use the \"Add Product Properties\" button on the Product Properties page for an individual product. *** You can also add \"Product Properties\" on the fly as you're editing a \"Product\" - you don't have to specify them ahead of time. Just be cautious of defining too many similar properties (\"Origin\", \"Country Origin\", \"Country of Origin\"). It's best to re-use existing properties wherever you can."},{"title":"Prototypes","url":"/solidus-guides/users/products/product_prototypes/","tags":[],"body":"## Introduction A Prototype is like a Product blueprint, useful for helping you add a group of similar new products to your store more quickly. The general procedure is that you create a Prototype which is associated with certain [Option Types](product_options) and [Properties](product_properties); then you create products based on that Prototype, and only need to fill in the values for those Option Types and Properties. Imagine that you've just received a new shipment of picture frames from your supplier. Your new stock encompasses a variety of brands, sizes, colors, and materials, but they are all basically the same type of product. This is a prime use case for prototypes. *** This guide presumes you have already created the [Option Types](product_options) and [Properties](product_properties) you need for your new prototype. If you haven't, you should do that first before proceeding. *** ### Creating a Prototype To create a prototype, go to the Admin Interface and click \"Products\", then \"Prototypes\". Click the \"New Prototype\" button. ![New Prototype Form](/images/user/products/new_prototype.jpg) Input a value for the \"Name\" field (such as \"Picture Frames\"), and choose the properties and options you want to associate with this type of product. ![Filled-In Prototype Form](/images/user/products/picture_frame_prototype.jpg) Click the \"Create\" button. You should now see your new prototype in the \"Prototypes\" list. ![Prototypes List](/images/user/products/prototypes.jpg) # Using a Prototype to Create Products To create a new product based on the new prototype, click \"Products\" from the Admin Interface, then click the \"New Product\" button. Select \"Picture Frames\" from the \"Prototypes\" drop-down menu. ![Product From Prototype](/images/user/products/product_from_prototype.jpg) When you do so, the Solidus system shows you values for both of the Option Types you entered, so that it can automatically create [Product Variants](creating_products#understanding-variants) for you for each of them. Let's create the Product and all Variants for the fictional \"Hinkledink Picture Frame\" product. Input the product's Name, SKU, a Master Price (remember, you can change this for each variant), and make sure to set the Available On date to today, so it will show up in your store. Check the boxes for the options this particular product has, and click \"Create\". *** Clicking the box next to an Option Type title will automatically check all of its Option Values for you. *** ![Prototype Option Types](/images/user/products/prototype_product_with_options.jpg) Proceed with [creating the product](creating-product) as you would normally, adding any missing fields not supplied by the prototype. Be sure to update each of the Variants with corresponding images, SKUs, and - if applicable - correct pricing."},{"title":"Searching Products","url":"/solidus-guides/users/products/searching_products/","tags":[],"body":"## Searching Products"},{"title":"Promotions","url":"/solidus-guides/users/promotions/","tags":[],"body":"## Introduction The Solidus cart's promotions functionality allows you to offer coupons and discount to your site's users, based on the conditions you choose. This guide will explain to you all of the options at hand. To reach the Promotions pane, go to your Admin Interface and click the \"Promotions\" tab. ## Creating a New Promotion To create a new promotion, click the \"New Promotion\" button. ![New Promotion](/images/user/promotions/new_promotion.jpg) The page that renders allows you to set several standard options that apply to all promotions. Each is explained below. Option | Description |---|---| Name | The name you assign for the promotion. Event Name | This is what must happen before the system will check to see if the promotion will apply to the order. Options are: **Add to cart** (any time an item is added to the cart), **Order contents changed** (an item is added to or removed from an order, or a quantity for an item in the order changes), **User signup** (a store visitor creates an account on the site), **Coupon code added** (a store visitor inputs a coupon code at checkout. The code has to match what you input for the code value if you select this option), or **Visit static content page** (a store visitor visits a path that you declare. This is often used to ensure that a customer has reviewed your store's policies or has been exposed to some other content that is important to your business model.) Advertise | Checking this box will make the promotion visible to site visitors as they shop your store. Description | A more thorough explanation of the promotion. The customer will be able to see this description at checkout. Usage Limit | The maximum total number of times the promotion can be used in your store across all users. If you don't input a value for this setting, the promotion can be used an unlimited number of times. Beneath this input field is a \"Current Usage\" counter, which is useful later when you're editing a promotion and need to know how many redemptions the promotion has had. Starts At | The date the promotion becomes valid. Expires At | The date after which the promotion is invalid. When you enter values for these fields and click \"Create\", a new screen is rendered, giving you access to even more options for fine-tuning your promotion. ### Rules Rules represent the factors that must be met for a promotion to be applicable to an order. You can set one or more rules for a single promotion. When you set multiple rules, you have the option of either requiring that all of the rules must be met for the promotion to apply, or allowing a promotion to apply to an order if even one of the rules is met. There are five types of rules. You can only add one rule of each type to a single promotion. Each is explained in detail below. ![Rules Options](/images/user/promotions/rules_options.jpg) #### Item Total When you select \"Item total\" from the \"Add Rule of Type\" drop-down menu and click \"Add\", you are declaring an Item Total rule. ![Item Total Rule](/images/user/promotions/item_total_rule.jpg) You can then set the parameters for this type of rule. Specifically, you can establish whether an order's items must be **greater than** or **equal to or greater than** the amount you set. Click \"Update\". *** To remove a rule from a promotion, click the trash can icon next to it. ![Delete Rule Icon](/images/user/promotions/delete_rule_icon.jpg) *** #### Products Using a rule of this type means the order must contain **at least one** or **all** of the products you declare. ![Products Rule](/images/user/promotions/products_rule.jpg) To create this kind of rule, just select \"Product(s)\" from the \"Add Rule of Type\" drop-down menu and click \"Add\". Start typing in the name of the product(s) you want to apply discounts to into the \"Choose Products\" box. Click on the correct variants. Choose either \"at least one\" or \"all\" from the selection box, and click \"Update\". #### User You can use the User rule type to restrict a promotion to only those customers you declare. To create this type of rule, select \"User\" from the \"Add Rule of Type\" drop-down menu and click \"Add\". Start typing in the name or email address of the user(s) you want to offer this promotion to. As the correct users are offered, click them to add them to the list. Click \"Update\". ![User Rule](/images/user/promotions/user_rule.jpg) #### First Order Select \"First order\" from the \"Add Rule of Type\" drop-down menu and click \"Add\" then \"Update\" to add a rule of this type to your promotion. This rule will restrict the promotion to only those customers ordering from you for the first time. ![First Order Rule](/images/user/promotions/first_order_rule.jpg) #### User Logged In Add a rule of this type to restrict the promotion only to logged-in users. Select \"User Logged In\" from the \"Add Rule of Type\" drop-down list, click \"Add\", then click \"Update\". ![Logged In Rule](/images/user/promotions/logged_in_rule.jpg) ### Actions Whereas [Rules](#rules) establish whether a promotion applies or not, Actions determine what happens when a promotion does apply to an order. There are two types of actions: [create adjustments](#create-adjustments) and [create line items](#create-line-items). #### Create Adjustments When you select \"Create adjustment\" from the \"Add Action of Type\" drop-down menu and click \"Add\", the system presents you with several calculator options. These are the same as the options you read about in the [calculators guide](calculators), except that instead of a [price sack calculator](calculators#price-sack), there are two additional calculators: percent per item and free shipping. ![Create Adjustments Action Calculators](/images/user/promotions/create_adjustment.jpg) By default, when you add a new \"Create adjustment\" calculator it sets it to a \"Flat percent\" calculator. You can change this by selecting the new calculator type from the \"Calculator\" drop-down menu, but you will need to click the \"Update\" button to get that calculator's specific additional required fields to display. Each calculator has its own set of required additional information fields. Calculator Type | Additional Data Required |---|---| Flat Percent | Percentage amount Flat Rate | Amount of discount, and currency Flexible Rate | The cost of the first item, the cost of each additional item, the maximum number of items included in the promotion, and the currency Percent Per Item | Percentage amount Free Shipping | No additional info required Enter all required information for your calculator type, then click \"Update\". #### Create Line Items This action type is a way of automatically adding items to an order when a promotion applies to an order. To add this action to your promotion, select \"Create line items\" from the \"Add Action of Type\" drop-down menu and click \"Add\". ![Create Line Item Action](/images/user/promotions/create_line_item.jpg) Select the quantity and variant you want automatically added to the customer's order from the product drop-down menu. Click \"Update\". !!! Product variants added through Line Item Action Promotions will be priced as usual. If your intention is to add a free product, you should do both a Line Item action to add the product, and an Adjustment action to discount the cost of that variant. !!! ## Editing a Promotion To edit a promotion, first go to the Promotions list (from the Admin Interface, click \"Promotions\"). Click the \"Edit\" icon next to the promotion. ![Edit Promotion Icon](/images/user/promotions/edit_promotion_icon.jpg) ## Removing a Promotion To remove a promotion, click the \"Delete\" icon next to the promotion in the Promotions list. ![Delete Promotion Icon](/images/user/promotions/delete_promotion_icon.jpg)"},{"title":"Reports","url":"/solidus-guides/users/reports/","tags":[],"body":"## Introduction Within the Admin Interface is a \"Reports\" tab. Information within this tab helps you understand how your store's income is apportioned. ### Sales Total From the Listing Reports page, click the \"Sales Total\" link. Here you, input a date range by selecting a Start date and an End date, then clicking \"Search\". ![Sales Total Dates](/images/user/sales_total_dates.jpg) The resulting report will show you - for each type of currency you accept - what your orders' item total, adjustment total, and sales total was. ![Sales Total Report](/images/user/sales_total_report.jpg)"},{"title":"Shipments","url":"/solidus-guides/users/shipments/","tags":[],"body":"## Shipments Solidus uses a very flexible and effective system to calculate shipping. This set of guides explains how Solidus renders shipping options to your customers at checkout, how it calculates expected costs, and how you can configure your store with your own shipping options to fit your needs. To properly leverage Soliduss shipping systems flexibility you must understand a few key concepts: * [Shipping Categories](shipping_categories) * [Zones](zones) * [Calculators](calculators) (to determine shipping rates) * [Shipping Methods](shipping_methods) Let's begin by understanding what [Shipping Categories](shipping_categories) are and how you can use them to differentiate products in your store."},{"title":"Calculators","url":"/solidus-guides/users/shipments/calculators/","tags":[],"body":"## Calculators A Calculator is the component of the Solidus shipping system responsible for calculating the shipping price for each available [Shipping Method](shipping_methods). Solidus ships with 5 default calculators: * [Flat rate (per order)](#flat-rate-per-order) * [Flat rate (per item)](#flat-rate-per-item) * [Flat percent](#flat-percent) * [Flexible rate](#flexible-rate) * [Price sack](#price-sack) ### Flat Rate (per order) The Flat Rate (per order) calculator allows you to charge the same shipping price per order regardless of the number of items in the order. You define the flat rate charged per order at the shipping method level. For example, if you have two shipping methods defined for your store (\"UPS 1-Day\" and \"UPS 2-Day\"), and have selected \"Flat rate\" as the calculator type for each, you could charge a $15 flat rate shipping cost for the UPS 1-Day orders and a $10 flat rate shipping cost for the UPS 2-Day orders. ### Flat Rate (per item) The Flat Rate (per item/product) calculator allows you to determine the shipping costs based on the number of items in the order. For example, if there are 4 items in an order and the flat rate per item amount is set to $10 then the total shipping costs for the order would be $40. ### Flat Percent The Flat Percent calculator allows you to calculate shipping costs as a percent of the total amount charged for the order. The amount is calculated as follows: ```ruby [item total] x [flat percentage]``` For example, if an order had an item total of $31 and the calculator was configured to have a flat percent amount of 10, the shipping cost would be $3.10, because $31 x 10% = $3.10. ### Flexible Rate The Flexible Rate calculator is typically used for promotional discounts when you want to give a specific discount for the first product, and then subsequent discounts for other products, up to a certain amount. The Flexible Rate calculator takes four inputs: * First Item Cost: the amount of shipping charged for the first item in the order. * Additional Item Cost: the amount of shipping charged for items beyond the first item. * Max Items: the maximum number of items on which shipping will be calculated. * Currency: defaults to the currency you have configured for your store. For example, if you set First Item Cost to $10, Additional Item Cost to $5, and Max Items to 4, you could be charging $10 for the first item, $5 for the next 3 items, and $0 for items beyond the first 4. Thus, an order with 1 item would have a shipping cost of $10. An order with two items would cost $15 to ship, and an order of 7 items would cost $25 to ship. ### Price Sack The Price Sack calculator is a way to offer discount shipping to orders over a certain dollar amount. The Price Sack calculator takes four inputs: * Minimal Amount * Normal Amount * Discount Amount * Currency (defaults to the currency you have configured for your store) Any order whose subtotal is under is less than what you set for Minimal Amount would be charged a shipping cost of Normal Amount. Orders whose subtotals are equal to or greater than the Minimal Amount would be charged the Discount Amount. For example, suppose you create a shipping calculator with these settings: * Minimal Amount - $50 * Normal Amount - $15 * Discount Amount - $5 A customer whose order subtotal equals $35 would be offered a shipping cost of $15 using this shipping method. A different customer whose order subtotal equals $55 would be offered a shipping cost of only $5. ### Custom Calculators You can define your own calculator if you have more complex needs. In that case, check out the [Calculators Guide](../developer/calculators.html). ## Next Step If you have followed this guide series [from the beginning](shipments), your store is now stocked with [shipping categories](shipping_categories), [geographical shipping zones](zones), and calculators. The final step is to pull it all together into [shipping methods](shipping_methods), from which your customers can choose at checkout."},{"title":"Shipping Categories","url":"/solidus-guides/users/shipments/shipping_categories/","tags":[],"body":"## Shipping Categories Shipping Categories are used to address special shipping needs for one or more of your products. The most common use for shipping categories is when certain products cannot be shipped in the same box. This is often due to a size or material constraint. For example, if a customer purchases a jump rope and a treadmill from an online exercise equipment store, the treadmill would be considered an over-sized item by most shipping carriers and would require special shipping arrangements. The jump rope could be sent via standard shipping. To handle this use case in Solidus you would define a \"Default\" shipping category for the jump rope and any other products that can use standard shipping methods, and an \"Over-sized\" shipping category for extremely large items like the treadmill. You would then assign the \"Over-sized\" shipping category to your treadmill product and the \"Default\" shipping category to your jump rope product. During checkout, the shipping categories assigned to the products in your customer's order will be a key factor in determining which shipping methods and costs your Solidus store offers to your customer at checkout. ### Creating a Shipping Category To create a new shipping category, go to the Admin Interface, click the \"Configuration\" tab, click the \"Shipping Categories\" link, and then click the \"New Shipping Category\" button. Enter a name for your new shipping category and click the \"Create\" button. ![New Shipping Category](/images/user/shipments/new_shipping_category.jpg) ### Adding a Shipping Category to a Product Once you've created your shipping categories you can assign the appropriate category to each of your products. To associate a shipping category with a product, go to the Admin Interface, and click the \"Products\" tab. Then, click on the product that you would like to edit from the list that appears. Once you are in edit mode for the product, select the shipping category you want to assign to the product from the \"Shipping Categories\" drop-down menu, and click \"Update\". ![Select Shipping Category](/images/user/shipments/select_shipping_category.jpg) ## Next Step Now that you understand how Shipping Categories work, let's move on to the next piece of the Solidus shipping system - shipping [zones](zones)."},{"title":"Shipping Methods","url":"/solidus-guides/users/shipments/shipping_methods/","tags":[],"body":"## Shipping Methods Now that you have set up all of the pieces you need, it's time to put them together into the shipping options that the customer sees when they reach checkout. These options are called Shipping Methods - they are the carriers and services used to send your products. ### Adding a Shipping Method To add a new shipping method to your store, go to the Admin Interface and click \"Configuration\", then \"Shipping Methods\". Click the \"New Shipping Method\" button to open the New Shipping Method form. ![New Shipping Method](/images/user/shipments/new_shipping_method.jpg) #### Name Enter a name for the shipping method. This is the exact wording that the customer will see at checkout. This should include both the carrier (USPS, UPS, Fedex, DHL, etc.) as well as the service type (First Class Mail, Overnight, Ground, etc.) So it would be very common to need several shipping methods for your store, for example: * USPS First Class * USPS First Class International * USPS Priority * USPS MediaMail * UPS Two-Day * UPS Ground * Fedex Overnight Remember that you will need to associate one or more [zones](#zones) with each shipping method in order for it to appear as an option at checkout. #### Display From the \"Display\" drop-down box, choose whether you want to have the option display only on the backend, the frontend, or both. Shipping methods that are displayed on the frontend can be chosen by your store's customers at checkout time, as long as the products in the order can be shipped by that carrier and the shipping address is one the carrier serves. If a shipping method is available only on backend, then only your store's administrators can assign it to an order. Some examples of cases where you might want to use a backend-only shipping method: * You sell handmade wind chimes. You want to offer a \"Pick-up in Store\" option, but only to certain customers. * With your online produce market you provide personal delivery of goods, but only to your best local customers. * Yours is a photography studio. You usually sell prints that physical delivery, but for some clients you are willing to send electronic media that they can print themselves. #### Tracking URL You can optionally input a tracking URL for your new shipping method. This allows customers to track the progress of their package from your [Stock Location](stock_locations) to the order's shipping address. The string \":tracking\" will be replaced with the tracking number you input once you actually process the order. You may need to check with the shipping carrier to see if they have a Shipping Confirmation URL that customers can use for this service. Some [commonly-used tracking URLs](http://verysimple.com/2011/07/06/ups-tracking-url/) are available online. !!! Please note that Solidus Commerce, Inc. makes no claims of warranty or accuracy for the information presented on third-party websites. We strongly urge you to verify the information independently before you put it into production on your store. !!! #### Categories Some shipping methods may only apply to certain types of products in your store, regardless of where those items are being shipped. You may only want to send over-sized items via UPS Ground, for example, and not via USPS Priority. The options shown in the \"Categories\" section correspond to the [Shipping Categories](shipping_categories) you set up in an earlier section of this guide series. ![Shipping Method Categories](/images/user/shipments/shipping_method_categories.jpg) Check the boxes next to the categories you want served by your new shipping method. #### Zones In [a previous step to this guide](zones) you learned about how to set up geographical zones for your store. Within the form's \"Zones\" section, you need to specify which zones are served by this shipping method. The \"EU_VAT\" (European Value-Added Tax) zone could be served by USPS First Class International, but could _not_ be served by USPS Priority Mail. ![Shipping Method Zones](/images/user/shipments/shipping_method_zones.jpg) Check the boxes next to any zones you want served by this shipping method. #### Calculator Each shipping method is associated with one [Calculator](calculators). You can choose one of the built-in Solidus calculators, or one you made yourself. ![Shipping Method Calculator](/images/user/shipments/shipping_method_calculator.jpg) Once you've made your calculator selection, click the \"Create\" button to finalize your new shipping method. The screen will refresh with one or more fields you'll use to set the parameters of your calculator. For example, creating a shipping method with a flat percent calculator will produce a screen like this: ![Shipping Method Flat Percent](/images/user/shipments/shipping_method_flat_percent.jpg) If necessary, you can re-read the [Calculators](calculators) portion of this guide series to better understand the options. Click the \"Update\" button, and your shipping method is now complete! ### Editing a Shipping Method To edit an existing method, go to the Admin Interface and click \"Configuration\", then \"Shipping Methods\". Click the \"Edit\" icon next to any of the shipping methods in the list. ![Edit Shipping Method](/images/user/shipments/edit_shipping_method.jpg) The form and all options that come up are the same as those you used in creating your shipping methods. ### Deleting a Shipping Method To delete a shipping method, go to the Admin Interface and click \"Configuration\", then \"Shipping Methods\". Click the \"Delete\" icon next to any of the shipping methods in the list. ![Delete Shipping Method](/images/user/shipments/delete_shipping_method.jpg) Confirm that you want to delete the shipping method by clicking \"OK\"."},{"title":"Zones","url":"/solidus-guides/users/shipments/zones/","tags":[],"body":"## Zones Zones serve as a way to define shipping rules for a particular geographic area. A zone is made up of a set of either countries or states. Zones are used within Solidus to define the rules for a [Shipping Method](shipping_methods). Each shipping method can be assigned to only one zone. For example, if one of the shipping methods for your store is UPS Ground (a US-only shipping carrier), then the zone for that shipping method should be defined as the United States. When the customer enters their shipping address during checkout, Solidus uses that information to determine which zone the order is being delivered to, and only presents the shipping methods to the customer that are defined for that zone. ### Creating a Zone To create a new zone, go to the Admin Interface, click the \"Configuration\" tab, click the \"Zones\" link, and then click the \"New Zone\" button. Enter a name and description for your new zone. Decide if you want it to be the default zone selected for the purposes of calculating sales tax. Choose whether you want the zone to be country-based or state-based. Click the \"Create\" button once complete. ![New Zone](/images/user/shipments/new_zone.jpg) ### Adding Members to a Zone Once you have a zone set up, you can associate either countries or states with it. To do this, go back to the Zones list (from the Admin Interface, click \"Configuration\", then \"Zones\"). Click the \"Edit\" icon next to the zone you just created. Click the \"Add Country\" or \"Add State\" button. ![Edit Zone Form](/images/user/shipments/edit_zone.jpg) Choose a country or state from the drop-down box and click the \"Add Country\" or \"Add State\" button. Follow the same steps to add additional countries or states for the Zone. ![Add Multiple Members](/images/user/shipments/add_multi_to_zone.jpg) Click \"Update\" once complete. ### Removing Members From a Zone It is easy to remove a state or country from one of your zones. Just go to your Admin Interface and click \"Configuration\", then \"Zones\". Click the \"Edit\" icon next to the zone you want to change. To remove a member of the zone, just click the X icon below its name. ![Remove a Zone Member](/images/user/shipments/remove_zone_member.jpg) ## Next Step Once you have set up all of the shipping zones you need, it's time to move on to the next Solidus shipping component: [Calculators](calculators)."}]}